<h1 align=center><font size = 5><b>Heroes Of Pymoli Data Analysis</b></font></h1><a name="top"></a>

-----

## **Introduction**

Heroes of Pymoli Data Analysis provides reporting on purchasing information. The information will provide meaningful insights and tools to explore more in the near future. Purchase information is from the games monitization outlets.

## Observations

* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  

* The peak age demographic, 20-24 (44.8%), also holds the highest purchases per demographic with 365 purchases (46.7%). Although they have the most purchases in the demographic, the average total purchase per person is ranked 3rd (4.32), after 0-10 (4.54) and 35-39 (4.76).

* Most popular item is 'Final Critic' with 13 sold. The average price for the item, since the item was sold at different prices, is 4.61. The a total value over is 59.99. 

* Most profitable item is 'Final Critic' with the same stats above. 'Signed Scalpel' sold 8 units, at 4.35, for a total of 34.80. 'Signed Scalpel' is the 5th most profitable item on the list, but does not show up on the top 5 most popular items list. More items have been sold at the 9 unit mark, but do not generate the same revenue.

## **Table of Contents**
Quickly find the Key Point Indicators used in this project to provide the observations claimed. 

* [Player Count](#Player-Counts)

* [Purchasing Analysis (Total)](#Purchasing-Analysis-Total)

* [Gender Demographics](#Gender-Demographic)

* [Purchasing Analysis (Gender)](#Purchasing-Analysis-Gender)

* [Age Demographics](#Age-Demographic)

* [Purchasing Analysis Age](#Purchasing-Analysis-Age)

* [Top Spenders](#Top-Spender)

* [Most Popular Items](#Most-Popular-Item)

* [Most Profitable Items](#Most-Profitable-Item)

**Start**: Import required libraries and data. Read and assign as purchase_data.

In [140]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

<a name="Player-Counts"></a>

## **Player Count**

* Display the total number of players

In [141]:
# Create dataframe with purchase data inported from csv
df_purchase_data = pd.DataFrame(purchase_data)
df_purchase_data.head()

# Clean data. Length is 780, we're looking for 576 as shown below.

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

### Answer

In [142]:
# Create column header used in new dataframe
column = ["Player Count"]

# use purchase data, column SN, to filter out duplicate SN and count total
# SN = Screen Name. We can discard the duplicates and keep one. We're looking for 
# actual users by screenname. 
player_count = df_purchase_data["SN"].value_counts().count()
df_pcount = pd.DataFrame({player_count}, columns = column)
df_pcount

   Player Count
0           576

<a name='Purchasing-Analysis-Total'></a>

## **Purchasing Analysis (Total)**

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Give the displayed data cleaner formatting


* Display the summary data frame

In [143]:
# Number of Purchases
num_of_purchases = int(df_purchase_data['Item Name'].count())
num_of_purchases

780

In [144]:
# Total Price
total_price = df_purchase_data['Price'].sum()
# Average Price
avg_price = (total_price / num_of_purchases).astype(float)

avg_price
#add this later when the final DF is made
#.map('${:,.2f}'.format)

3.0509871794871795

In [145]:
# Unique Item count
unique_items = df_purchase_data['Item Name'].nunique()
unique_items

179

In [146]:
# Purchasing analysis tool: Summary dataframe
purchase_summary = [{'Number of Unique Items': unique_items,
                    'Average Price': avg_price,
                    'Number of Purchases': num_of_purchases,
                    'Total Revenue': total_price}]
df_purchase_summary = pd.DataFrame(purchase_summary)

In [147]:
#Style Average Purchase Price and Total Purchase Value as currency with two decimals
df_purchase_summary["Average Price"] = df_purchase_summary["Average Price"].map("${:.2f}".format)
df_purchase_summary["Total Revenue"] = df_purchase_summary["Total Revenue"].map("${:.2f}".format)

### Answer

In [148]:
df_purchase_summary

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

<a name="Gender-Demographic"></a>

## **Gender Demographics**

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [149]:
# DataFrame for purchase data without duplicate SN
df2_purchase_data = df_purchase_data.drop_duplicates(subset='SN', keep='first')
df2_purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19

In [150]:
# DF for purchase data without duplicate SN, by Gender. 
gender_count = df2_purchase_data["Gender"].value_counts()
gender_count_df = pd.DataFrame(gender_count)
gender_count_df

                       Gender
Male                      484
Female                     81
Other / Non-Disclosed      11

In [151]:
# Calculate gender percentage values. Assign % format. Generate to list to add to df
gender_percent = gender_count[0]/player_count, gender_count[1]/player_count, gender_count[2]/player_count
gender_percent = pd.Series(["{0:.2f}%".format(val * 100) for val in gender_percent])
gender_percent = gender_percent.to_list()
gender_percent

['84.03%', '14.06%', '1.91%']

In [152]:
# Create a new column and add gender_percent data
gender_count_df.insert(1, "Percentage of Players", gender_percent)

### Answer

In [153]:
# Finalize Gender Count DataFrame
gender_count_df

                       Gender Percentage of Players
Male                      484                84.03%
Female                     81                14.06%
Other / Non-Disclosed      11                 1.91%

<a name="Purchasing-Analysis-Gender"></a>


## **Purchasing Analysis (Gender)**

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Give the displayed data cleaner formatting


* Display the summary data frame

In [154]:
# Make copy of original data. Original data is used because we are filtering through all purchases, repeat customers included.
# No duplicates removed in df
converted_purchase_data_df = df_purchase_data[["Purchase ID", "SN", "Gender","Price",]].copy()
#converted_purchase_data_df

In [155]:
# Grouped Data: Gender as the Index
grouped_purchase_gender = converted_purchase_data_df.groupby(['Gender'])
grouped_purchase_gender

In [156]:
# Average purchase price by gender - Group
grouped_purchase_gender_sum = grouped_purchase_gender['Price'].count()
grouped_purchase_gender_sum

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [157]:
# Average Purchase Price by Gender - Group
grouped_purchase_gender_mean = grouped_purchase_gender['Price'].mean()
grouped_purchase_gender_mean

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [158]:
# Average purchase price by gender - Group
grouped_price_gender_sum = grouped_purchase_gender['Price'].sum()
grouped_price_gender_sum

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [159]:
# Average purchase total per person by gender - Group
grouped_price_gender_avg = grouped_price_gender_sum / gender_count_df['Gender']
grouped_price_gender_avg

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [160]:
# Create a DataFrame with the 4 grouped results
purchase_analysis_gender_df = pd.DataFrame({"Purchase Count": grouped_purchase_gender_sum, 
                                            "Average Purchase Price": grouped_purchase_gender_mean, 
                                            "Total Purchase Value": grouped_price_gender_sum,
                                            "Avg Total Purchase per Person": grouped_price_gender_avg
                                           })
purchase_analysis_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [161]:
# Style selected columns expressing currency and 2 decimal spaces
purchase_analysis_gender_df = purchase_analysis_gender_df.style.format({"Average Purchase Price": "${:20,.2f}", 
                                                          "Total Purchase Value": "${:20,.2f}", 
                                                          "Avg Total Purchase per Person": "${:20,.2f}"
                                                         })

### Answer

In [162]:
purchase_analysis_gender_df

<a name="Age-Demographic"></a>

## **Age Demographics**

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Round the percentage column to two decimal points


* Display Age Demographics Table

In [163]:
converted_age_demo_df2 = df2_purchase_data.copy()
converted_age_demo_df2["Age"]

0      20
1      40
2      24
3      24
4      23
       ..
773    21
774    11
775    21
777    20
778     7
Name: Age, Length: 576, dtype: int64

In [164]:
# Establish bins for ages
age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 50]
age_bin_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [165]:
# Categorize existing players using the age bins (with pd.cut)
converted_age_demo_df2['Age Ranges'] = pd.cut(
        x = converted_age_demo_df2["Age"],
        bins = age_bins,
        labels = age_bin_labels)
converted_age_demo_df2

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02,20-24
774,774,Jiskjask80,11,Male,92,Final Critic,4.19,10-14
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10

In [166]:
# Count amount of Users by SN
player_count = converted_age_demo_df2["SN"].count()

In [167]:
# Calculate the numbers and percentages by age group
# Create a GroupBy object based upon "Age Demo"
age_group = converted_age_demo_df2.groupby(by="Age Ranges")

# Count Age into bins
age_group_sum = age_group["Age"].count()
age_group_sum

Age Ranges
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: Age, dtype: int64

In [168]:
# Get percentage of age group to bins
age_group_avg = (age_group_sum / player_count) * 100
age_group_avg

Age Ranges
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: Age, dtype: float64

In [169]:
# Create a summary data of binned age group to hold the results
age_demo_df = pd.DataFrame({"Total Count": age_group_sum, 
                                            "Percentage of Players": age_group_avg
                                           })
age_demo_df

            Total Count  Percentage of Players
Age Ranges
<10                  17               2.951389
10-14                22               3.819444
15-19               107              18.576389
20-24               258              44.791667
25-29                77              13.368056
30-34                52               9.027778
35-39                31               5.381944
40+                  12               2.083333

In [170]:
# Optional: round the percentage column to two decimal points
age_demo_df = age_demo_df.style.format({"Percentage of Players": "{:20,.2f}%"
                                                         })

### Answer

In [171]:
# Display Age Demographics Table
age_demo_df

<a name="Purchasing-Analysis-Age"></a>

## **Purchasing Analysis (Age)**

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Give the displayed data cleaner formatting


* Display the summary data frame

In [172]:
# Make copy of df before moving on
converted_purchase_data_df2 = df_purchase_data.copy()

In [173]:
# Bin the purchase_data data frame by age
age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 50]
age_bin_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [174]:
# Cut bins into current df before grouping
converted_purchase_data_df2['Age Ranges'] = pd.cut(
        x = converted_purchase_data_df2["Age"],
        bins = age_bins,
        labels = age_bin_labels)
converted_purchase_data_df2

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [175]:
grouped_purchase_age = converted_purchase_data_df2.groupby(['Age Ranges'])
grouped_purchase_age

In [176]:
# purchase count / age
purchase_count_age = grouped_purchase_age['Purchase ID'].count()
purchase_count_age

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [177]:
# avg. purchase price
purchase_avg_age = grouped_purchase_age['Price'].mean()
purchase_avg_age

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [178]:
# total purchase value
purchase_total_age  = grouped_purchase_age['Price'].sum()
purchase_total_age

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [179]:
# Avg. purchase total purchase per person 
purchase_total_per_person_age = purchase_total_age / age_group_sum
purchase_total_per_person_age

Age Ranges
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [180]:
# Create a DataFrame with the 4 grouped results
purchase_analysis_age_df = pd.DataFrame({"Purchase Count": purchase_count_age, 
                                            "Average Purchase Price": purchase_avg_age, 
                                            "Total Purchase Value": purchase_total_age,
                                            "Avg Total Purchase per Person": purchase_total_per_person_age
                                           })
purchase_analysis_age_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [181]:
# Style selected columns expressing currency and 2 decimal spaces
purchase_analysis_age_df = purchase_analysis_age_df.style.format({"Average Purchase Price": "${:20,.2f}", 
                                                          "Total Purchase Value": "${:20,.2f}", 
                                                          "Avg Total Purchase per Person": "${:20,.2f}"
                                                         })
purchase_analysis_age_df

### Answer

In [182]:
purchase_analysis_age_df

<a name="Top-Spender"></a>

## **Top Spenders**

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [183]:
# Make copy of df before moving on
converted_purchase_data_df3 = df_purchase_data.copy()

In [184]:
# Find value count by SN
converted_purchase_data_df3['SN'].value_counts()

Lisosia93       5
Idastidru52     4
Iral74          4
Iskadarya95     3
Ilarin91        3
               ..
Undista85       1
Tyaelaelis94    1
Sondadarya58    1
Lisovynya38     1
Iskosia90       1
Name: SN, Length: 576, dtype: int64

In [185]:
# Group information by SN for filtering
grouped_sn = converted_purchase_data_df3.groupby('SN')

In [186]:
# Find Max 
grouped_sn_purchase_count = grouped_sn['Purchase ID'].count()
grouped_sn_purchase_count.max()

5

In [187]:
# Group and find avg price per SN
grouped_sn_purchase_avg = grouped_sn['Price'].mean()
grouped_sn_purchase_avg

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [188]:
grouped_sn_purchase_sum = grouped_sn['Price'].sum()
grouped_sn_purchase_sum.max()

18.96

In [189]:
# Create a DataFrame with values requested
top_spenders_df = pd.DataFrame({
    "Purchase Count": grouped_sn_purchase_count,
    "Average Purchase Price": grouped_sn_purchase_avg,
    "Total Purchase Value": grouped_sn_purchase_sum})
top_spenders_df.max()

Purchase Count             5.00
Average Purchase Price     4.99
Total Purchase Value      18.96
dtype: float64

In [190]:
# Sort top spenders by descending
top_spenders_df.sort_values("Total Purchase Value", ascending=False)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10
...                     ...                     ...                   ...
Ililsasya43               1                1.020000                  1.02
Irilis75                  1                1.020000                  1.02
Aidai61                   1                1.010000                  1.01
Chanirra79                1                1.010000                  1.01
Alo38                     1                1.000000                  1.00

[576 rows x 3 columns]

In [191]:
# Sort by Total Purchase Value -- Decending
top_spenders_df_sorted = top_spenders_df.sort_values("Total Purchase Value", ascending=False)

In [192]:
#Style Average Purchase Price and Total Purchase Value as currency with two decimals
top_spenders_df_sorted["Average Purchase Price"] = top_spenders_df_sorted["Average Purchase Price"].map("${:.2f}".format)
top_spenders_df_sorted["Total Purchase Value"] = top_spenders_df_sorted["Total Purchase Value"].map("${:.2f}".format)

### Answer

In [193]:
top_spenders_df_sorted.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

<a name="Most-Popular-Item"></a>

## **Most Popular Items**

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [194]:
# Make copy of df before moving on
converted_purchase_data_df4 = df_purchase_data[['Item ID', 'Item Name', 'Price']].copy()

In [195]:
# Group by Item ID and Item Name
grouped_itemID_itemName = converted_purchase_data_df4.groupby(["Item ID", "Item Name"])

In [196]:
# Item Price average :: Some items have been sold for different prices. The average will be calculated and put under item price
# Some items have not sold for different prices and will not be changed.
item_prices = grouped_itemID_itemName['Price'].mean()

In [197]:
# Purchase Count 
grouped_purchase_count = grouped_itemID_itemName['Price'].count()

In [198]:
# Grouped Total Purchase Value 
grouped_purchase_sum = grouped_itemID_itemName['Price'].sum()

In [199]:
# Create a DataFrame with values requested
most_pop_items_df = pd.DataFrame({
    "Purchase Count": grouped_purchase_count,
    "Item Price": item_prices,
    "Total Purchase Value": grouped_purchase_sum})
most_pop_items_df

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.2800,5.12
1,Crucifer,4,2.9425,11.77
2,Verdict,6,2.4800,14.88
3,Phantomlight,6,2.4900,14.94
4,Bloodlord's Fetish,5,1.7000,8.50
...,...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300,50.76
179,"Wolf, Promise of the Moonwalker",6,4.4800,26.88
181,Reaper's Toll,5,1.6600,8.30
182,Toothpick,3,4.0300,12.09
183,Dragon's Greatsword,3,1.0900,3.27

In [200]:
# Sort by descending 
most_pop_items_df = most_pop_items_df.sort_values("Purchase Count", ascending=False)

In [201]:
# Sort by descending - Most profitable items - Used in next section 'Most Profitable Items'
most_profit_items_df = most_pop_items_df.sort_values("Total Purchase Value", ascending=False)

In [202]:
#Style Average Purchase Price and Total Purchase Value as currency with two decimals
most_pop_items_df["Item Price"] = most_pop_items_df["Item Price"].map("${:.2f}".format)
most_pop_items_df["Total Purchase Value"] = most_pop_items_df["Total Purchase Value"].map("${:.2f}".format)

### Answer

In [203]:
most_pop_items_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

<a name="Most-Profitable-Item"></a>

## **Most Profitable Items**

* Sort the above table by total purchase value in descending order


* Give the displayed data cleaner formatting


* Display a preview of the data frame

In [204]:
#Style Average Purchase Price and Total Purchase Value as currency with two decimals
most_profit_items_df["Item Price"] = most_profit_items_df["Item Price"].map("${:.2f}".format)
most_profit_items_df["Total Purchase Value"] = most_profit_items_df["Total Purchase Value"].map("${:.2f}".format)

### Answer

In [205]:
most_profit_items_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80